/*********************************************************
模块名       : 
文件名       :IdentifySet.cpp
相关文件     :Set.hpp
文件实现功能 :用户标识集合类
作者         :zhangzx 
版本         :1.0 
**********************************************************/
#include "IdentifySet.hpp"
#include "Func.hpp"

/*********************************************************
函数说明：构造函数
入参说明：
出参说明：
返回值  ：
*********************************************************/
CIdentifySet::CIdentifySet()
{

}

/*********************************************************
函数说明：析构函数
入参说明：
出参说明：
返回值  ：
*********************************************************/
CIdentifySet::~CIdentifySet()
{

}

/*********************************************************
函数说明：接收处理数据包
入参说明：
出参说明：
返回值  ：
*********************************************************/
bool CIdentifySet::DealRcvPkt(CHelloPkt *pkt)
{
	return true;
}

/*********************************************************
函数说明：超时检测
入参说明：
出参说明：
返回值  ：
*********************************************************/
void CIdentifySet::CheckTimeOut()
{

}


