/*********************************************************
模块名       : 
文件名       :ServiceSet.cpp
相关文件     :Set.hpp
文件实现功能 :服务节点集合类
作者         :zhangzx 
版本         :1.0 
**********************************************************/
#include "ServiceSet.hpp"
#include "NDFunc.hpp"

/*********************************************************
函数说明：构造函数
入参说明：
出参说明：
返回值  ：
*********************************************************/
CServiceSet::CServiceSet()
{

}

/*********************************************************
函数说明：析构函数
入参说明：
出参说明：
返回值  ：
*********************************************************/
CServiceSet::~CServiceSet()
{

}

/*********************************************************
函数说明：接收处理数据包
入参说明：
出参说明：
返回值  ：
*********************************************************/
bool CServiceSet::DealRcvPkt(CHelloPkt *pkt)
{
	return true;
}

/*********************************************************
函数说明：接收处理数据包
入参说明：
出参说明：
返回值  ：
*********************************************************/
void CServiceSet::CheckServiceSrv()
{

}


